
import os
from pymongo import MongoClient
from datetime import datetime, timezone
from dotenv import load_dotenv
load_dotenv()
# TODO variable --------

def insurance_json():
    plan_index = 0  # 方案
    plan_name = 's方案'
    person = "本人" # 幫誰保保險
    days = 2 # 旅遊天數
    person_count = 1  # 幫幾個人保
    country = '日本' # 旅遊地點
    age = 27
    
    
    insured_amount_price = 5000000  # 投保額度
    insurance_premium_price = 354  # 保費
    sudden_illness_price = 500000 # 海外突發疾病健康保險
    medical_insurance_price = 500000 # 傷害醫療費用保險
    Death_disability_price = 5000000 # 旅行平安保險
    trip_cancel_price = 10000  # 旅程更改保險

    flight_delay_price = 1000 # 班機延誤保險(定額型)
    trip_change_price = 10000 # 旅程更改保險
    baggage_delay_price = 1000 # 行李延誤保險(定額型)
    baggage_damage_price = 2000 # 行李損失保險(定額型)
    file_damage_price = 1000 # 旅行文件損失保險(定額型)
    third_party_price = 250000 # 第三人責任險
    emergency_assistance_price = 250000 # 急難救助

    create_date = datetime.now(timezone.utc)
    update_date = datetime.now(timezone.utc)
    
    return_json = {
            "plan": [{"plan_index":plan_index, "plan_name":plan_name}],
            "insured_amount": { "price": insured_amount_price, "name": "投保額度" },
            "insurance_premium": { "price": insurance_premium_price, "name": "保費" },
            "country": country,
            "person":person,
            "person_count":person_count,
            "days":days,
            "age": [{"age":age},{"name":"年齡"}],
            "travel_insurance": {
            "name": "旅平險",
            "content": [
                {
                "sudden_illness": {
                    "price": sudden_illness_price,
                    "name": "海外突發疾病健康保險",
                    "description": [
                    "(1) 海外突發疾病住院醫療保險：被保險人於本保險契約賠償責任期間內，在海外因條款所定義之突發疾病需住院診療時，本公司就其住院第一日起至第一百八十日止所實際發生之住院醫療費用給付「海外突發疾病住院醫療保險金」。(2) 海外突發疾病門診醫療保險：保險人於本保險契約賠償責任期間內，在海外因突發疾病而需接受門診診療時，本公司就其實際發生之門診醫療費用給付「海外突發疾病門診醫療保險金」，但每次門診醫療保險金的給付總額以本保險契約所載之「海外突發疾病住院醫療保險金限額」乘上「海外特定地區限額調整係數表」之調整係數之千分之五為限，且每日給付次數以一次為限。註：被保險人依中華民國傳染病防治法第三條規定所稱之傳染病所生之住院、門診或急診費用，本公司不負給付海外突發疾病的各項醫療保險金的責任，但契約另有約定者不在此限。※本保險契約之用詞定義如下：一、海外：係指臺灣、澎湖、金門、馬祖等由中華民國政府所轄範圍以外之地區。二、突發疾病：係指被保險人需即時在醫院或診所診療始能避免損及身體健康之疾病，且在本公司該次賠償責任期間開始日前一百八十天以內，未曾接受該疾病之診療者。三、醫院：係指依照當地醫療法規定領有開業執照並設有病房收治病人之公、私立及醫療法人醫院。四、診所：係指依照當地醫療法規定領有開業執照的診所。五、住院：係指被保險人經醫師診斷其突發疾病必須入住醫院，且正式辦理住院手續並確實在醫院接受診療者。但不包含相當於中華民國全民健康保險法第五十一條所稱之日間住院及精神衛生法第三十五條所稱之日間留院。六、醫師：係指依照當地政府之法令規定，合法領有醫師執照之執業醫師，且非要保人本人或被保險人本人。"
                    ]
                    
                },
                "medical_insurance": {
                    "price": medical_insurance_price,
                    "name": "傷害醫療費用保險",
                    "description": [
                    "被保險人於本公司賠償責任期間內，因遭受本保險契約條款所約定之意外傷害事故，致其支出醫療費用時，本公司依照本保險契約的約定，給付保險金。"
                    ],
                    "necessities":["理賠申請書","保單或投保憑證影本","事故證明","診斷証明書正本","實支實付：醫療費用收據正本","癌症件:病理切片報告/檢驗報告","骨折件:X 光片(碟)","受益人之身分證明","存摺影印本"]
                },
                "Death_disability": {
                    "price": Death_disability_price,
                    "name": "旅行平安保險",
                    "description": [
                    "被保險人於本公司賠償責任期間內，因遭受本保險契約條款所約定之意外傷害事故，致其身體蒙受傷害而致失能或死亡時，本公司依照本保險契約的約定，給付保險金。"
                    ],
                    "necessities":[{"失能":["理賠申請書","保單或投保憑證影本","事故證明","診斷証明書正本","受益人之身分證明","存摺影印本"]},
                                {"身故":["理賠申請書","保單或投保憑證影本","事故證明","診斷証明書正本","受益人之身分證明","除戶戶口名簿謄本","法定繼承人聲明書","繼承系統表","死亡證明書","存摺影印本"]}]
                    
                }
                }
            ]
            },
            "travel_inconvenience_insurance": {
            "name": "不便險",
            "content": [
                {
                "index": 0,
                "trip_cancel": {
                    "price": trip_cancel_price,
                    "name": "旅程取消保險(實支實付)",
                    "count":1,
                    "description": [
                    "被保險人於預定海外旅程開始前七日至海外旅行期間開始前，因下列第一款至第四款事故致其必須取消預定之全部旅程，對於被保險人無法取回之預繳團費、交通、住宿及票券之費用，本公司依本保險契約之約定對被保險人負理賠之責：一、被保險人、配偶或三親等內親屬死亡或病危者。二、被保險人於中華民國境內擔任訴訟之證人。三、被保險人預定搭乘之公共交通工具業者之受僱人罷工，致所預定搭乘之班次取消或延誤達二十四小時，或其預定前往之地點發生暴動、民眾騷擾之情事。四、被保險人在中華民國境內住居所之建築物及置存於其內之動產，因火災、洪水、地震、颱風或其他天災毀損，且損失金額超過新臺幣二十五萬元者。前項住宿費用不包含他人同宿之費用，如有他人同宿時，本公司依人數比例計算保險金，最高以本保險單所載保險金額為限。"
                    ]
                    ,
                    
                    "explain":"小明計畫至義大利旅遊度過10天假期，並於出發前8天即上網投保富邦產險旅平險XL方案，卻在出發前一日收到重病已久的爺爺(三親等內)的病危通知，故只能取消行程，對於這段旅程取消後無法取回之預繳團費、交通費、住宿費及票券費，保險公司於額度內給付保險金。"
                    ,"necessities":["理賠申請書","存摺影印本","身分證、護照影本","事故證明文件：死亡診斷書、屍體相驗證明書或醫院或醫師開立之病危通知書正本及該死亡或病危者之身分關係證明文件影本"]
                },
                "index": 1,
                "flight_delay": {
                    "price": flight_delay_price,
                    "name": "班機延誤保險(定額型)",
                    "count":1,
                    "description": [
                    "被保險人於海外旅行期間內，其隨行託運並取得託運行李領取單之個人行李因公共交通工具業者之處理失當，致其在抵達目的地六小時後仍未領得時，本公司依本保險契約約定之保險金額給付保險金。對於下列事故與物品，本公司不負理賠責任：一、被保險人於返回中華民國境內機場之行李延誤。二、被保險人於返回出發地或居住所之行李延誤。三、被保險人事先運送之行李，或非隨身託運而分開郵寄或運送之物品。"
                    ],
                    "explain":"小邦與女友準備搭乘廉價航空到日本賞櫻，預定為早上9時之航班，到達機場後卻接獲通知飛機因異常故停止飛行，且航空公司無安排替代班機。小邦臨時購買了其他航空公司的班機繼續行程前往日本，並於當日14時起飛。對於此次班機延誤超過四小時，保險公司依約定給付定額保險金。",
                    "necessities":["理賠申請書","機票及登機證或航空業者出具之搭機證明","航空業者所出具載有班機延誤期間之證明"]
                },
                "index": 2,
                "trip_change": {
                    "price": trip_change_price,
                    "name": "旅程更改保險(實支實付)",
                    "count":1,
                    "description": [
                    "被保險人於海外旅行期間內，因下列事故致被保險人必須更改其預定旅程因而所增加之交通或住宿費用，本公司依本保險契約之約定對被保險人負理賠之責：一、預定搭乘之公共交通工具業者之受僱人罷工，或預定前往之地點發生戰爭、暴動、民眾騷擾、天災。二、居住於中華民國境內之被保險人配偶或三親等內親屬死亡。三、本次旅程所使用之護照或旅行文件遺失。四、因搭乘汽車、火車、航空器或輪船等發生交通意外事故。前項所增加之交通或住宿費用，以被保險人原預定之交通及住宿同等級之費用為限，惟應扣除可由旅館業者、交通工具業者、旅行社或其他提供旅行、住宿業者處獲得之退款或非貨幣形式償還之等值金額。前二項之住宿費用不包含他人同宿之費用，如有他人同宿時，本公司依人數比例計算保險金，最高以本保險單所載保險金額為限。"
                    ],
                    "explain":"小林規劃自義大利前往法國旅遊，搭乘火車前往的過程中，火車不幸發生交通意外事故，雖然身體無礙但行程被迫更改，需臨時尋找飯店入住，隔日再搭客運前往。對於更改其預定旅程因而所增加之交通與住宿費用，保險公司依約於保額限度內負理賠之責。",
                    "necessities":["理賠申請書","存摺影印本","身分證、護照影本","交通或住宿收據證明"]
                },
                "index": 3,
                "baggage_delay": {
                    "price": baggage_delay_price,
                    "name": "行李延誤保險(定額型)",
                    "count":1,
                    "description": [
                    "被保險人於海外旅行期間內，其隨行託運並取得託運行李領取單之個人行李因公共交通工具業者之處理失當，致其在抵達目的地六小時後仍未領得時，本公司依本保險契約約定之保險金額給付保險金。對於下列事故與物品，本公司不負理賠責任：一、被保險人於返回中華民國境內機場之行李延誤。二、被保險人於返回出發地或居住所之行李延誤。三、被保險人事先運送之行李，或非隨身託運而分開郵寄或運送之物品。"
                    ],
                    "explain":"小邦與女友準備搭乘廉價航空到日本賞櫻，預定為早上9時之航班，到達機場後卻接獲通知飛機因異常故停止飛行，且航空公司無安排替代班機。小邦臨時購買了其他航空公司的班機繼續行程前往日本，並於當日14時起飛。對於此次班機延誤超過四小時，保險公司依約定給付定額保險金。",
                    "necessities":["理賠申請書","公共交通工具業者所出具行李延誤達六小時以上之文件"]
                },
                "index": 4,
                "baggage_damage": {
                    "price": baggage_damage_price,
                    "name": "行李損失保險(定額型)",
                    "count":2,
                    "description": [
                    "被保險人於海外旅行期間內，因下列事故致其所擁有且置於行李箱、手提箱或類似容器內之個人物品遭受毀損或滅失，本公司依本保險契約約定之保險金額給付保險金，但保險期間內以給二次為限。一、竊盜、強盜與搶奪。二、交由所搭乘之公共交通工具業者託運且領有託運行李領取單之隨行託運行李，因該公共交通工具業者處理失當所致之毀損、滅失或遺失。"
                    ],
                    "explain":"小華安排旅行前往倫敦，領行李時發現行李因航空公司處裡失當導致托運行李遺失，因此小華向該航空公司開立之事故與損失證明，並於回國後向保險公司申請理賠，事後保險公司也依約定給付定額保險金予小華。",
                    "necessities":["理賠申請書","存摺影印本","身分證、護照影本","警方報案證明或航空公司開立之事故與損失之證明"]
                },
                "index": 5,
                "file_damage": {
                    "price": file_damage_price,
                    "name": "旅行文件損失保險(定額型)",
                    "count":1,
                    "description": [
                    "被保險人於海外旅行期間內，因本次旅程使用之旅行文件(護照、簽證及其他作為出入國境或通行之文件)被強盜、搶奪、竊盜或遺失時，本公司依約定之保險金額給付保險金。"
                    ],
                    "explain":"小陳在法國旅遊期間發現自己的護照及簽證遭竊，便馬上報警同時請當地警方開立報案證明以作為後續理賠文件，事後保險公司也依約定給付定額保險金予小陳。",
                    "necessities":["理賠申請書","存摺影印本","身分證、護照影本","警方報案證明"]
                }
                }
            ]
            },
            "third_party": {
            "name": "第三人責任險",
            "content": [
                {
                "price": third_party_price,
                "name": "第三人責任險",
                "description": [
                    "被保險人於本保險契約約定之賠償責任期間內，對於第三人之體傷、死亡或財物受損，依法應負賠償責任，而受賠償請求時，本公司依約對被保險人負理賠責任。"
                ],
                "necessities":["理賠申請書","保單或投保憑證影本","事故證明","受益人之身分證明","存摺影印本","費用單據","和解書及體傷或財損相關資料","損失清單"]
                }
            ]
            },
            "emergency_assistance": {
            "name": "急難救助",
            "content": [
                {
                "price": emergency_assistance_price,
                "name": "緊急救援費用保險",
                "description": [
                    "被保險人於本保險契約約定之賠償責任期間內，因下列事故致其本人或親友必須支付救援費用，本公司依條款契約規定負給付保險金之責。一、於中華民國境外旅行時：1.因遭受意外傷害事故，並自意外傷害事故發生之日起一百八十日以內死亡者。2.於中華民國境外，因賠償責任期間內發生之意外事故引起突發疾病而死亡，或因該突發疾病而於賠償責任期間屆滿後三十日內死亡者。3.因遭受意外傷害事故，或於中華民國境外因意外事故引起突發疾病，因而須接受治療且連續住院七日以上者；若被保險人住院期間須轉院治療者，該轉送期間亦計入上開期間。二、於中華民國境內旅行時：1.因遭受意外傷害事故，並自意外傷害事故發生之日起一百八十日以內死亡者。2.因遭受意外傷害事故而須接受治療，且連續住院十四日以上者；若被保險人住院期間須轉院治療者，該轉送期間亦計入上開期間。三、因其所搭乘之飛機或船舶遭遇意外災難而行蹤不明；且警方、政府機關或救難組織已展開搜救者。四、因登山而行蹤不明；前開所謂行蹤不明，指被保險人超過原預定下山時間四十八小時，且警方或救難組織已開始搜救者。五、遭受意外傷害事故失蹤，且警方或救難組織已開始搜救者。"
                ]
                }
            ]
            },
            "create_data":create_date,
            "update_date":update_date
        }
    collection = insert_mongodb_atlas()
    collection.insert_one(return_json)
    

def insert_mongodb_atlas():
    uri = os.getenv("MONGODB_URI")
    conn = MongoClient(uri)
    try:
        conn.admin.command('ping')
        print("Pinged your deployment. You successfully connected to MongoDB!")
    except Exception as e:
        print(e)

    # Create a MongoClient instance
    db = conn['flying_high']
    # Access a collection (similar to a table in relational databases)
    collection = db['insurance_fubung']

    mongo_dblist = conn.list_database_names()
    if "flying_high" in mongo_dblist:
        print("flying_high database 已存在！")
    else:
        print('flying_high database 不存在')
    
    return collection

insurance_json()